{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_lat_lon", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 2], "dtype": "float32", "sparse": false, "name": "input_lat_lon"}, "inbound_nodes": []}, {"name": "input_day", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 7], "dtype": "float32", "sparse": false, "name": "input_day"}, "inbound_nodes": []}, {"name": "input_hour", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 24], "dtype": "float32", "sparse": false, "name": "input_hour"}, "inbound_nodes": []}, {"name": "input_category", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 10], "dtype": "float32", "sparse": false, "name": "input_category"}, "inbound_nodes": []}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaB3Vuc3RhY2spAdoBeKkAcgYAAAD6OS9tZWRpYS9yYWlkL2ppbm1lbmcvcGV0cnktMjAy\nMC1tYXJjL0xTVE1fVHJhakdBTi9tb2RlbC5wedoIPGxhbWJkYT5bAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_lat_lon", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaB3Vuc3RhY2spAdoBeKkAcgYAAAD6OS9tZWRpYS9yYWlkL2ppbm1lbmcvcGV0cnktMjAy\nMC1tYXJjL0xTVE1fVHJhakdBTi9tb2RlbC5wedoIPGxhbWJkYT5iAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_day", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaB3Vuc3RhY2spAdoBeKkAcgYAAAD6OS9tZWRpYS9yYWlkL2ppbm1lbmcvcGV0cnktMjAy\nMC1tYXJjL0xTVE1fVHJhakdBTi9tb2RlbC5wedoIPGxhbWJkYT5iAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_hour", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaB3Vuc3RhY2spAdoBeKkAcgYAAAD6OS9tZWRpYS9yYWlkL2ppbm1lbmcvcGV0cnktMjAy\nMC1tYXJjL0xTVE1fVHJhakdBTi9tb2RlbC5wedoIPGxhbWJkYT5iAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_category", 0, 0, {}]]]}, {"name": "emb_lat_lon", "class_name": "Dense", "config": {"name": "emb_lat_lon", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]], [["lambda_13", 0, 1, {}]], [["lambda_13", 0, 2, {}]], [["lambda_13", 0, 3, {}]], [["lambda_13", 0, 4, {}]], [["lambda_13", 0, 5, {}]], [["lambda_13", 0, 6, {}]], [["lambda_13", 0, 7, {}]], [["lambda_13", 0, 8, {}]], [["lambda_13", 0, 9, {}]], [["lambda_13", 0, 10, {}]], [["lambda_13", 0, 11, {}]], [["lambda_13", 0, 12, {}]], [["lambda_13", 0, 13, {}]], [["lambda_13", 0, 14, {}]], [["lambda_13", 0, 15, {}]], [["lambda_13", 0, 16, {}]], [["lambda_13", 0, 17, {}]], [["lambda_13", 0, 18, {}]], [["lambda_13", 0, 19, {}]], [["lambda_13", 0, 20, {}]], [["lambda_13", 0, 21, {}]], [["lambda_13", 0, 22, {}]], [["lambda_13", 0, 23, {}]], [["lambda_13", 0, 24, {}]], [["lambda_13", 0, 25, {}]], [["lambda_13", 0, 26, {}]], [["lambda_13", 0, 27, {}]], [["lambda_13", 0, 28, {}]], [["lambda_13", 0, 29, {}]], [["lambda_13", 0, 30, {}]], [["lambda_13", 0, 31, {}]], [["lambda_13", 0, 32, {}]], [["lambda_13", 0, 33, {}]], [["lambda_13", 0, 34, {}]], [["lambda_13", 0, 35, {}]], [["lambda_13", 0, 36, {}]], [["lambda_13", 0, 37, {}]], [["lambda_13", 0, 38, {}]], [["lambda_13", 0, 39, {}]], [["lambda_13", 0, 40, {}]], [["lambda_13", 0, 41, {}]], [["lambda_13", 0, 42, {}]], [["lambda_13", 0, 43, {}]], [["lambda_13", 0, 44, {}]], [["lambda_13", 0, 45, {}]], [["lambda_13", 0, 46, {}]], [["lambda_13", 0, 47, {}]], [["lambda_13", 0, 48, {}]], [["lambda_13", 0, 49, {}]], [["lambda_13", 0, 50, {}]], [["lambda_13", 0, 51, {}]], [["lambda_13", 0, 52, {}]], [["lambda_13", 0, 53, {}]], [["lambda_13", 0, 54, {}]], [["lambda_13", 0, 55, {}]], [["lambda_13", 0, 56, {}]], [["lambda_13", 0, 57, {}]], [["lambda_13", 0, 58, {}]], [["lambda_13", 0, 59, {}]], [["lambda_13", 0, 60, {}]], [["lambda_13", 0, 61, {}]], [["lambda_13", 0, 62, {}]], [["lambda_13", 0, 63, {}]], [["lambda_13", 0, 64, {}]], [["lambda_13", 0, 65, {}]], [["lambda_13", 0, 66, {}]], [["lambda_13", 0, 67, {}]], [["lambda_13", 0, 68, {}]], [["lambda_13", 0, 69, {}]], [["lambda_13", 0, 70, {}]], [["lambda_13", 0, 71, {}]], [["lambda_13", 0, 72, {}]], [["lambda_13", 0, 73, {}]], [["lambda_13", 0, 74, {}]], [["lambda_13", 0, 75, {}]], [["lambda_13", 0, 76, {}]], [["lambda_13", 0, 77, {}]], [["lambda_13", 0, 78, {}]], [["lambda_13", 0, 79, {}]], [["lambda_13", 0, 80, {}]], [["lambda_13", 0, 81, {}]], [["lambda_13", 0, 82, {}]], [["lambda_13", 0, 83, {}]], [["lambda_13", 0, 84, {}]], [["lambda_13", 0, 85, {}]], [["lambda_13", 0, 86, {}]], [["lambda_13", 0, 87, {}]], [["lambda_13", 0, 88, {}]], [["lambda_13", 0, 89, {}]], [["lambda_13", 0, 90, {}]], [["lambda_13", 0, 91, {}]], [["lambda_13", 0, 92, {}]], [["lambda_13", 0, 93, {}]], [["lambda_13", 0, 94, {}]], [["lambda_13", 0, 95, {}]], [["lambda_13", 0, 96, {}]], [["lambda_13", 0, 97, {}]], [["lambda_13", 0, 98, {}]], [["lambda_13", 0, 99, {}]], [["lambda_13", 0, 100, {}]], [["lambda_13", 0, 101, {}]], [["lambda_13", 0, 102, {}]], [["lambda_13", 0, 103, {}]], [["lambda_13", 0, 104, {}]], [["lambda_13", 0, 105, {}]], [["lambda_13", 0, 106, {}]], [["lambda_13", 0, 107, {}]], [["lambda_13", 0, 108, {}]], [["lambda_13", 0, 109, {}]], [["lambda_13", 0, 110, {}]], [["lambda_13", 0, 111, {}]], [["lambda_13", 0, 112, {}]], [["lambda_13", 0, 113, {}]], [["lambda_13", 0, 114, {}]], [["lambda_13", 0, 115, {}]], [["lambda_13", 0, 116, {}]], [["lambda_13", 0, 117, {}]], [["lambda_13", 0, 118, {}]], [["lambda_13", 0, 119, {}]], [["lambda_13", 0, 120, {}]], [["lambda_13", 0, 121, {}]], [["lambda_13", 0, 122, {}]], [["lambda_13", 0, 123, {}]], [["lambda_13", 0, 124, {}]], [["lambda_13", 0, 125, {}]], [["lambda_13", 0, 126, {}]], [["lambda_13", 0, 127, {}]], [["lambda_13", 0, 128, {}]], [["lambda_13", 0, 129, {}]], [["lambda_13", 0, 130, {}]], [["lambda_13", 0, 131, {}]], [["lambda_13", 0, 132, {}]], [["lambda_13", 0, 133, {}]], [["lambda_13", 0, 134, {}]], [["lambda_13", 0, 135, {}]], [["lambda_13", 0, 136, {}]], [["lambda_13", 0, 137, {}]], [["lambda_13", 0, 138, {}]], [["lambda_13", 0, 139, {}]], [["lambda_13", 0, 140, {}]], [["lambda_13", 0, 141, {}]], [["lambda_13", 0, 142, {}]], [["lambda_13", 0, 143, {}]]]}, {"name": "emb_day", "class_name": "Dense", "config": {"name": "emb_day", "trainable": true, "units": 7, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_15", 0, 0, {}]], [["lambda_15", 0, 1, {}]], [["lambda_15", 0, 2, {}]], [["lambda_15", 0, 3, {}]], [["lambda_15", 0, 4, {}]], [["lambda_15", 0, 5, {}]], [["lambda_15", 0, 6, {}]], [["lambda_15", 0, 7, {}]], [["lambda_15", 0, 8, {}]], [["lambda_15", 0, 9, {}]], [["lambda_15", 0, 10, {}]], [["lambda_15", 0, 11, {}]], [["lambda_15", 0, 12, {}]], [["lambda_15", 0, 13, {}]], [["lambda_15", 0, 14, {}]], [["lambda_15", 0, 15, {}]], [["lambda_15", 0, 16, {}]], [["lambda_15", 0, 17, {}]], [["lambda_15", 0, 18, {}]], [["lambda_15", 0, 19, {}]], [["lambda_15", 0, 20, {}]], [["lambda_15", 0, 21, {}]], [["lambda_15", 0, 22, {}]], [["lambda_15", 0, 23, {}]], [["lambda_15", 0, 24, {}]], [["lambda_15", 0, 25, {}]], [["lambda_15", 0, 26, {}]], [["lambda_15", 0, 27, {}]], [["lambda_15", 0, 28, {}]], [["lambda_15", 0, 29, {}]], [["lambda_15", 0, 30, {}]], [["lambda_15", 0, 31, {}]], [["lambda_15", 0, 32, {}]], [["lambda_15", 0, 33, {}]], [["lambda_15", 0, 34, {}]], [["lambda_15", 0, 35, {}]], [["lambda_15", 0, 36, {}]], [["lambda_15", 0, 37, {}]], [["lambda_15", 0, 38, {}]], [["lambda_15", 0, 39, {}]], [["lambda_15", 0, 40, {}]], [["lambda_15", 0, 41, {}]], [["lambda_15", 0, 42, {}]], [["lambda_15", 0, 43, {}]], [["lambda_15", 0, 44, {}]], [["lambda_15", 0, 45, {}]], [["lambda_15", 0, 46, {}]], [["lambda_15", 0, 47, {}]], [["lambda_15", 0, 48, {}]], [["lambda_15", 0, 49, {}]], [["lambda_15", 0, 50, {}]], [["lambda_15", 0, 51, {}]], [["lambda_15", 0, 52, {}]], [["lambda_15", 0, 53, {}]], [["lambda_15", 0, 54, {}]], [["lambda_15", 0, 55, {}]], [["lambda_15", 0, 56, {}]], [["lambda_15", 0, 57, {}]], [["lambda_15", 0, 58, {}]], [["lambda_15", 0, 59, {}]], [["lambda_15", 0, 60, {}]], [["lambda_15", 0, 61, {}]], [["lambda_15", 0, 62, {}]], [["lambda_15", 0, 63, {}]], [["lambda_15", 0, 64, {}]], [["lambda_15", 0, 65, {}]], [["lambda_15", 0, 66, {}]], [["lambda_15", 0, 67, {}]], [["lambda_15", 0, 68, {}]], [["lambda_15", 0, 69, {}]], [["lambda_15", 0, 70, {}]], [["lambda_15", 0, 71, {}]], [["lambda_15", 0, 72, {}]], [["lambda_15", 0, 73, {}]], [["lambda_15", 0, 74, {}]], [["lambda_15", 0, 75, {}]], [["lambda_15", 0, 76, {}]], [["lambda_15", 0, 77, {}]], [["lambda_15", 0, 78, {}]], [["lambda_15", 0, 79, {}]], [["lambda_15", 0, 80, {}]], [["lambda_15", 0, 81, {}]], [["lambda_15", 0, 82, {}]], [["lambda_15", 0, 83, {}]], [["lambda_15", 0, 84, {}]], [["lambda_15", 0, 85, {}]], [["lambda_15", 0, 86, {}]], [["lambda_15", 0, 87, {}]], [["lambda_15", 0, 88, {}]], [["lambda_15", 0, 89, {}]], [["lambda_15", 0, 90, {}]], [["lambda_15", 0, 91, {}]], [["lambda_15", 0, 92, {}]], [["lambda_15", 0, 93, {}]], [["lambda_15", 0, 94, {}]], [["lambda_15", 0, 95, {}]], [["lambda_15", 0, 96, {}]], [["lambda_15", 0, 97, {}]], [["lambda_15", 0, 98, {}]], [["lambda_15", 0, 99, {}]], [["lambda_15", 0, 100, {}]], [["lambda_15", 0, 101, {}]], [["lambda_15", 0, 102, {}]], [["lambda_15", 0, 103, {}]], [["lambda_15", 0, 104, {}]], [["lambda_15", 0, 105, {}]], [["lambda_15", 0, 106, {}]], [["lambda_15", 0, 107, {}]], [["lambda_15", 0, 108, {}]], [["lambda_15", 0, 109, {}]], [["lambda_15", 0, 110, {}]], [["lambda_15", 0, 111, {}]], [["lambda_15", 0, 112, {}]], [["lambda_15", 0, 113, {}]], [["lambda_15", 0, 114, {}]], [["lambda_15", 0, 115, {}]], [["lambda_15", 0, 116, {}]], [["lambda_15", 0, 117, {}]], [["lambda_15", 0, 118, {}]], [["lambda_15", 0, 119, {}]], [["lambda_15", 0, 120, {}]], [["lambda_15", 0, 121, {}]], [["lambda_15", 0, 122, {}]], [["lambda_15", 0, 123, {}]], [["lambda_15", 0, 124, {}]], [["lambda_15", 0, 125, {}]], [["lambda_15", 0, 126, {}]], [["lambda_15", 0, 127, {}]], [["lambda_15", 0, 128, {}]], [["lambda_15", 0, 129, {}]], [["lambda_15", 0, 130, {}]], [["lambda_15", 0, 131, {}]], [["lambda_15", 0, 132, {}]], [["lambda_15", 0, 133, {}]], [["lambda_15", 0, 134, {}]], [["lambda_15", 0, 135, {}]], [["lambda_15", 0, 136, {}]], [["lambda_15", 0, 137, {}]], [["lambda_15", 0, 138, {}]], [["lambda_15", 0, 139, {}]], [["lambda_15", 0, 140, {}]], [["lambda_15", 0, 141, {}]], [["lambda_15", 0, 142, {}]], [["lambda_15", 0, 143, {}]]]}, {"name": "emb_hour", "class_name": "Dense", "config": {"name": "emb_hour", "trainable": true, "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_17", 0, 0, {}]], [["lambda_17", 0, 1, {}]], [["lambda_17", 0, 2, {}]], [["lambda_17", 0, 3, {}]], [["lambda_17", 0, 4, {}]], [["lambda_17", 0, 5, {}]], [["lambda_17", 0, 6, {}]], [["lambda_17", 0, 7, {}]], [["lambda_17", 0, 8, {}]], [["lambda_17", 0, 9, {}]], [["lambda_17", 0, 10, {}]], [["lambda_17", 0, 11, {}]], [["lambda_17", 0, 12, {}]], [["lambda_17", 0, 13, {}]], [["lambda_17", 0, 14, {}]], [["lambda_17", 0, 15, {}]], [["lambda_17", 0, 16, {}]], [["lambda_17", 0, 17, {}]], [["lambda_17", 0, 18, {}]], [["lambda_17", 0, 19, {}]], [["lambda_17", 0, 20, {}]], [["lambda_17", 0, 21, {}]], [["lambda_17", 0, 22, {}]], [["lambda_17", 0, 23, {}]], [["lambda_17", 0, 24, {}]], [["lambda_17", 0, 25, {}]], [["lambda_17", 0, 26, {}]], [["lambda_17", 0, 27, {}]], [["lambda_17", 0, 28, {}]], [["lambda_17", 0, 29, {}]], [["lambda_17", 0, 30, {}]], [["lambda_17", 0, 31, {}]], [["lambda_17", 0, 32, {}]], [["lambda_17", 0, 33, {}]], [["lambda_17", 0, 34, {}]], [["lambda_17", 0, 35, {}]], [["lambda_17", 0, 36, {}]], [["lambda_17", 0, 37, {}]], [["lambda_17", 0, 38, {}]], [["lambda_17", 0, 39, {}]], [["lambda_17", 0, 40, {}]], [["lambda_17", 0, 41, {}]], [["lambda_17", 0, 42, {}]], [["lambda_17", 0, 43, {}]], [["lambda_17", 0, 44, {}]], [["lambda_17", 0, 45, {}]], [["lambda_17", 0, 46, {}]], [["lambda_17", 0, 47, {}]], [["lambda_17", 0, 48, {}]], [["lambda_17", 0, 49, {}]], [["lambda_17", 0, 50, {}]], [["lambda_17", 0, 51, {}]], [["lambda_17", 0, 52, {}]], [["lambda_17", 0, 53, {}]], [["lambda_17", 0, 54, {}]], [["lambda_17", 0, 55, {}]], [["lambda_17", 0, 56, {}]], [["lambda_17", 0, 57, {}]], [["lambda_17", 0, 58, {}]], [["lambda_17", 0, 59, {}]], [["lambda_17", 0, 60, {}]], [["lambda_17", 0, 61, {}]], [["lambda_17", 0, 62, {}]], [["lambda_17", 0, 63, {}]], [["lambda_17", 0, 64, {}]], [["lambda_17", 0, 65, {}]], [["lambda_17", 0, 66, {}]], [["lambda_17", 0, 67, {}]], [["lambda_17", 0, 68, {}]], [["lambda_17", 0, 69, {}]], [["lambda_17", 0, 70, {}]], [["lambda_17", 0, 71, {}]], [["lambda_17", 0, 72, {}]], [["lambda_17", 0, 73, {}]], [["lambda_17", 0, 74, {}]], [["lambda_17", 0, 75, {}]], [["lambda_17", 0, 76, {}]], [["lambda_17", 0, 77, {}]], [["lambda_17", 0, 78, {}]], [["lambda_17", 0, 79, {}]], [["lambda_17", 0, 80, {}]], [["lambda_17", 0, 81, {}]], [["lambda_17", 0, 82, {}]], [["lambda_17", 0, 83, {}]], [["lambda_17", 0, 84, {}]], [["lambda_17", 0, 85, {}]], [["lambda_17", 0, 86, {}]], [["lambda_17", 0, 87, {}]], [["lambda_17", 0, 88, {}]], [["lambda_17", 0, 89, {}]], [["lambda_17", 0, 90, {}]], [["lambda_17", 0, 91, {}]], [["lambda_17", 0, 92, {}]], [["lambda_17", 0, 93, {}]], [["lambda_17", 0, 94, {}]], [["lambda_17", 0, 95, {}]], [["lambda_17", 0, 96, {}]], [["lambda_17", 0, 97, {}]], [["lambda_17", 0, 98, {}]], [["lambda_17", 0, 99, {}]], [["lambda_17", 0, 100, {}]], [["lambda_17", 0, 101, {}]], [["lambda_17", 0, 102, {}]], [["lambda_17", 0, 103, {}]], [["lambda_17", 0, 104, {}]], [["lambda_17", 0, 105, {}]], [["lambda_17", 0, 106, {}]], [["lambda_17", 0, 107, {}]], [["lambda_17", 0, 108, {}]], [["lambda_17", 0, 109, {}]], [["lambda_17", 0, 110, {}]], [["lambda_17", 0, 111, {}]], [["lambda_17", 0, 112, {}]], [["lambda_17", 0, 113, {}]], [["lambda_17", 0, 114, {}]], [["lambda_17", 0, 115, {}]], [["lambda_17", 0, 116, {}]], [["lambda_17", 0, 117, {}]], [["lambda_17", 0, 118, {}]], [["lambda_17", 0, 119, {}]], [["lambda_17", 0, 120, {}]], [["lambda_17", 0, 121, {}]], [["lambda_17", 0, 122, {}]], [["lambda_17", 0, 123, {}]], [["lambda_17", 0, 124, {}]], [["lambda_17", 0, 125, {}]], [["lambda_17", 0, 126, {}]], [["lambda_17", 0, 127, {}]], [["lambda_17", 0, 128, {}]], [["lambda_17", 0, 129, {}]], [["lambda_17", 0, 130, {}]], [["lambda_17", 0, 131, {}]], [["lambda_17", 0, 132, {}]], [["lambda_17", 0, 133, {}]], [["lambda_17", 0, 134, {}]], [["lambda_17", 0, 135, {}]], [["lambda_17", 0, 136, {}]], [["lambda_17", 0, 137, {}]], [["lambda_17", 0, 138, {}]], [["lambda_17", 0, 139, {}]], [["lambda_17", 0, 140, {}]], [["lambda_17", 0, 141, {}]], [["lambda_17", 0, 142, {}]], [["lambda_17", 0, 143, {}]]]}, {"name": "emb_category", "class_name": "Dense", "config": {"name": "emb_category", "trainable": true, "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_19", 0, 0, {}]], [["lambda_19", 0, 1, {}]], [["lambda_19", 0, 2, {}]], [["lambda_19", 0, 3, {}]], [["lambda_19", 0, 4, {}]], [["lambda_19", 0, 5, {}]], [["lambda_19", 0, 6, {}]], [["lambda_19", 0, 7, {}]], [["lambda_19", 0, 8, {}]], [["lambda_19", 0, 9, {}]], [["lambda_19", 0, 10, {}]], [["lambda_19", 0, 11, {}]], [["lambda_19", 0, 12, {}]], [["lambda_19", 0, 13, {}]], [["lambda_19", 0, 14, {}]], [["lambda_19", 0, 15, {}]], [["lambda_19", 0, 16, {}]], [["lambda_19", 0, 17, {}]], [["lambda_19", 0, 18, {}]], [["lambda_19", 0, 19, {}]], [["lambda_19", 0, 20, {}]], [["lambda_19", 0, 21, {}]], [["lambda_19", 0, 22, {}]], [["lambda_19", 0, 23, {}]], [["lambda_19", 0, 24, {}]], [["lambda_19", 0, 25, {}]], [["lambda_19", 0, 26, {}]], [["lambda_19", 0, 27, {}]], [["lambda_19", 0, 28, {}]], [["lambda_19", 0, 29, {}]], [["lambda_19", 0, 30, {}]], [["lambda_19", 0, 31, {}]], [["lambda_19", 0, 32, {}]], [["lambda_19", 0, 33, {}]], [["lambda_19", 0, 34, {}]], [["lambda_19", 0, 35, {}]], [["lambda_19", 0, 36, {}]], [["lambda_19", 0, 37, {}]], [["lambda_19", 0, 38, {}]], [["lambda_19", 0, 39, {}]], [["lambda_19", 0, 40, {}]], [["lambda_19", 0, 41, {}]], [["lambda_19", 0, 42, {}]], [["lambda_19", 0, 43, {}]], [["lambda_19", 0, 44, {}]], [["lambda_19", 0, 45, {}]], [["lambda_19", 0, 46, {}]], [["lambda_19", 0, 47, {}]], [["lambda_19", 0, 48, {}]], [["lambda_19", 0, 49, {}]], [["lambda_19", 0, 50, {}]], [["lambda_19", 0, 51, {}]], [["lambda_19", 0, 52, {}]], [["lambda_19", 0, 53, {}]], [["lambda_19", 0, 54, {}]], [["lambda_19", 0, 55, {}]], [["lambda_19", 0, 56, {}]], [["lambda_19", 0, 57, {}]], [["lambda_19", 0, 58, {}]], [["lambda_19", 0, 59, {}]], [["lambda_19", 0, 60, {}]], [["lambda_19", 0, 61, {}]], [["lambda_19", 0, 62, {}]], [["lambda_19", 0, 63, {}]], [["lambda_19", 0, 64, {}]], [["lambda_19", 0, 65, {}]], [["lambda_19", 0, 66, {}]], [["lambda_19", 0, 67, {}]], [["lambda_19", 0, 68, {}]], [["lambda_19", 0, 69, {}]], [["lambda_19", 0, 70, {}]], [["lambda_19", 0, 71, {}]], [["lambda_19", 0, 72, {}]], [["lambda_19", 0, 73, {}]], [["lambda_19", 0, 74, {}]], [["lambda_19", 0, 75, {}]], [["lambda_19", 0, 76, {}]], [["lambda_19", 0, 77, {}]], [["lambda_19", 0, 78, {}]], [["lambda_19", 0, 79, {}]], [["lambda_19", 0, 80, {}]], [["lambda_19", 0, 81, {}]], [["lambda_19", 0, 82, {}]], [["lambda_19", 0, 83, {}]], [["lambda_19", 0, 84, {}]], [["lambda_19", 0, 85, {}]], [["lambda_19", 0, 86, {}]], [["lambda_19", 0, 87, {}]], [["lambda_19", 0, 88, {}]], [["lambda_19", 0, 89, {}]], [["lambda_19", 0, 90, {}]], [["lambda_19", 0, 91, {}]], [["lambda_19", 0, 92, {}]], [["lambda_19", 0, 93, {}]], [["lambda_19", 0, 94, {}]], [["lambda_19", 0, 95, {}]], [["lambda_19", 0, 96, {}]], [["lambda_19", 0, 97, {}]], [["lambda_19", 0, 98, {}]], [["lambda_19", 0, 99, {}]], [["lambda_19", 0, 100, {}]], [["lambda_19", 0, 101, {}]], [["lambda_19", 0, 102, {}]], [["lambda_19", 0, 103, {}]], [["lambda_19", 0, 104, {}]], [["lambda_19", 0, 105, {}]], [["lambda_19", 0, 106, {}]], [["lambda_19", 0, 107, {}]], [["lambda_19", 0, 108, {}]], [["lambda_19", 0, 109, {}]], [["lambda_19", 0, 110, {}]], [["lambda_19", 0, 111, {}]], [["lambda_19", 0, 112, {}]], [["lambda_19", 0, 113, {}]], [["lambda_19", 0, 114, {}]], [["lambda_19", 0, 115, {}]], [["lambda_19", 0, 116, {}]], [["lambda_19", 0, 117, {}]], [["lambda_19", 0, 118, {}]], [["lambda_19", 0, 119, {}]], [["lambda_19", 0, 120, {}]], [["lambda_19", 0, 121, {}]], [["lambda_19", 0, 122, {}]], [["lambda_19", 0, 123, {}]], [["lambda_19", 0, 124, {}]], [["lambda_19", 0, 125, {}]], [["lambda_19", 0, 126, {}]], [["lambda_19", 0, 127, {}]], [["lambda_19", 0, 128, {}]], [["lambda_19", 0, 129, {}]], [["lambda_19", 0, 130, {}]], [["lambda_19", 0, 131, {}]], [["lambda_19", 0, 132, {}]], [["lambda_19", 0, 133, {}]], [["lambda_19", 0, 134, {}]], [["lambda_19", 0, 135, {}]], [["lambda_19", 0, 136, {}]], [["lambda_19", 0, 137, {}]], [["lambda_19", 0, 138, {}]], [["lambda_19", 0, 139, {}]], [["lambda_19", 0, 140, {}]], [["lambda_19", 0, 141, {}]], [["lambda_19", 0, 142, {}]], [["lambda_19", 0, 143, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaBXN0YWNrKQHaAXipAHIGAAAA+jkvbWVkaWEvcmFpZC9qaW5tZW5nL3BldHJ5LTIwMjAt\nbWFyYy9MU1RNX1RyYWpHQU4vbW9kZWwucHnaCDxsYW1iZGE+XgAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["emb_lat_lon", 0, 0, {}], ["emb_lat_lon", 1, 0, {}], ["emb_lat_lon", 2, 0, {}], ["emb_lat_lon", 3, 0, {}], ["emb_lat_lon", 4, 0, {}], ["emb_lat_lon", 5, 0, {}], ["emb_lat_lon", 6, 0, {}], ["emb_lat_lon", 7, 0, {}], ["emb_lat_lon", 8, 0, {}], ["emb_lat_lon", 9, 0, {}], ["emb_lat_lon", 10, 0, {}], ["emb_lat_lon", 11, 0, {}], ["emb_lat_lon", 12, 0, {}], ["emb_lat_lon", 13, 0, {}], ["emb_lat_lon", 14, 0, {}], ["emb_lat_lon", 15, 0, {}], ["emb_lat_lon", 16, 0, {}], ["emb_lat_lon", 17, 0, {}], ["emb_lat_lon", 18, 0, {}], ["emb_lat_lon", 19, 0, {}], ["emb_lat_lon", 20, 0, {}], ["emb_lat_lon", 21, 0, {}], ["emb_lat_lon", 22, 0, {}], ["emb_lat_lon", 23, 0, {}], ["emb_lat_lon", 24, 0, {}], ["emb_lat_lon", 25, 0, {}], ["emb_lat_lon", 26, 0, {}], ["emb_lat_lon", 27, 0, {}], ["emb_lat_lon", 28, 0, {}], ["emb_lat_lon", 29, 0, {}], ["emb_lat_lon", 30, 0, {}], ["emb_lat_lon", 31, 0, {}], ["emb_lat_lon", 32, 0, {}], ["emb_lat_lon", 33, 0, {}], ["emb_lat_lon", 34, 0, {}], ["emb_lat_lon", 35, 0, {}], ["emb_lat_lon", 36, 0, {}], ["emb_lat_lon", 37, 0, {}], ["emb_lat_lon", 38, 0, {}], ["emb_lat_lon", 39, 0, {}], ["emb_lat_lon", 40, 0, {}], ["emb_lat_lon", 41, 0, {}], ["emb_lat_lon", 42, 0, {}], ["emb_lat_lon", 43, 0, {}], ["emb_lat_lon", 44, 0, {}], ["emb_lat_lon", 45, 0, {}], ["emb_lat_lon", 46, 0, {}], ["emb_lat_lon", 47, 0, {}], ["emb_lat_lon", 48, 0, {}], ["emb_lat_lon", 49, 0, {}], ["emb_lat_lon", 50, 0, {}], ["emb_lat_lon", 51, 0, {}], ["emb_lat_lon", 52, 0, {}], ["emb_lat_lon", 53, 0, {}], ["emb_lat_lon", 54, 0, {}], ["emb_lat_lon", 55, 0, {}], ["emb_lat_lon", 56, 0, {}], ["emb_lat_lon", 57, 0, {}], ["emb_lat_lon", 58, 0, {}], ["emb_lat_lon", 59, 0, {}], ["emb_lat_lon", 60, 0, {}], ["emb_lat_lon", 61, 0, {}], ["emb_lat_lon", 62, 0, {}], ["emb_lat_lon", 63, 0, {}], ["emb_lat_lon", 64, 0, {}], ["emb_lat_lon", 65, 0, {}], ["emb_lat_lon", 66, 0, {}], ["emb_lat_lon", 67, 0, {}], ["emb_lat_lon", 68, 0, {}], ["emb_lat_lon", 69, 0, {}], ["emb_lat_lon", 70, 0, {}], ["emb_lat_lon", 71, 0, {}], ["emb_lat_lon", 72, 0, {}], ["emb_lat_lon", 73, 0, {}], ["emb_lat_lon", 74, 0, {}], ["emb_lat_lon", 75, 0, {}], ["emb_lat_lon", 76, 0, {}], ["emb_lat_lon", 77, 0, {}], ["emb_lat_lon", 78, 0, {}], ["emb_lat_lon", 79, 0, {}], ["emb_lat_lon", 80, 0, {}], ["emb_lat_lon", 81, 0, {}], ["emb_lat_lon", 82, 0, {}], ["emb_lat_lon", 83, 0, {}], ["emb_lat_lon", 84, 0, {}], ["emb_lat_lon", 85, 0, {}], ["emb_lat_lon", 86, 0, {}], ["emb_lat_lon", 87, 0, {}], ["emb_lat_lon", 88, 0, {}], ["emb_lat_lon", 89, 0, {}], ["emb_lat_lon", 90, 0, {}], ["emb_lat_lon", 91, 0, {}], ["emb_lat_lon", 92, 0, {}], ["emb_lat_lon", 93, 0, {}], ["emb_lat_lon", 94, 0, {}], ["emb_lat_lon", 95, 0, {}], ["emb_lat_lon", 96, 0, {}], ["emb_lat_lon", 97, 0, {}], ["emb_lat_lon", 98, 0, {}], ["emb_lat_lon", 99, 0, {}], ["emb_lat_lon", 100, 0, {}], ["emb_lat_lon", 101, 0, {}], ["emb_lat_lon", 102, 0, {}], ["emb_lat_lon", 103, 0, {}], ["emb_lat_lon", 104, 0, {}], ["emb_lat_lon", 105, 0, {}], ["emb_lat_lon", 106, 0, {}], ["emb_lat_lon", 107, 0, {}], ["emb_lat_lon", 108, 0, {}], ["emb_lat_lon", 109, 0, {}], ["emb_lat_lon", 110, 0, {}], ["emb_lat_lon", 111, 0, {}], ["emb_lat_lon", 112, 0, {}], ["emb_lat_lon", 113, 0, {}], ["emb_lat_lon", 114, 0, {}], ["emb_lat_lon", 115, 0, {}], ["emb_lat_lon", 116, 0, {}], ["emb_lat_lon", 117, 0, {}], ["emb_lat_lon", 118, 0, {}], ["emb_lat_lon", 119, 0, {}], ["emb_lat_lon", 120, 0, {}], ["emb_lat_lon", 121, 0, {}], ["emb_lat_lon", 122, 0, {}], ["emb_lat_lon", 123, 0, {}], ["emb_lat_lon", 124, 0, {}], ["emb_lat_lon", 125, 0, {}], ["emb_lat_lon", 126, 0, {}], ["emb_lat_lon", 127, 0, {}], ["emb_lat_lon", 128, 0, {}], ["emb_lat_lon", 129, 0, {}], ["emb_lat_lon", 130, 0, {}], ["emb_lat_lon", 131, 0, {}], ["emb_lat_lon", 132, 0, {}], ["emb_lat_lon", 133, 0, {}], ["emb_lat_lon", 134, 0, {}], ["emb_lat_lon", 135, 0, {}], ["emb_lat_lon", 136, 0, {}], ["emb_lat_lon", 137, 0, {}], ["emb_lat_lon", 138, 0, {}], ["emb_lat_lon", 139, 0, {}], ["emb_lat_lon", 140, 0, {}], ["emb_lat_lon", 141, 0, {}], ["emb_lat_lon", 142, 0, {}], ["emb_lat_lon", 143, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaBXN0YWNrKQHaAXipAHIGAAAA+jkvbWVkaWEvcmFpZC9qaW5tZW5nL3BldHJ5LTIwMjAt\nbWFyYy9MU1RNX1RyYWpHQU4vbW9kZWwucHnaCDxsYW1iZGE+ZQAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["emb_day", 0, 0, {}], ["emb_day", 1, 0, {}], ["emb_day", 2, 0, {}], ["emb_day", 3, 0, {}], ["emb_day", 4, 0, {}], ["emb_day", 5, 0, {}], ["emb_day", 6, 0, {}], ["emb_day", 7, 0, {}], ["emb_day", 8, 0, {}], ["emb_day", 9, 0, {}], ["emb_day", 10, 0, {}], ["emb_day", 11, 0, {}], ["emb_day", 12, 0, {}], ["emb_day", 13, 0, {}], ["emb_day", 14, 0, {}], ["emb_day", 15, 0, {}], ["emb_day", 16, 0, {}], ["emb_day", 17, 0, {}], ["emb_day", 18, 0, {}], ["emb_day", 19, 0, {}], ["emb_day", 20, 0, {}], ["emb_day", 21, 0, {}], ["emb_day", 22, 0, {}], ["emb_day", 23, 0, {}], ["emb_day", 24, 0, {}], ["emb_day", 25, 0, {}], ["emb_day", 26, 0, {}], ["emb_day", 27, 0, {}], ["emb_day", 28, 0, {}], ["emb_day", 29, 0, {}], ["emb_day", 30, 0, {}], ["emb_day", 31, 0, {}], ["emb_day", 32, 0, {}], ["emb_day", 33, 0, {}], ["emb_day", 34, 0, {}], ["emb_day", 35, 0, {}], ["emb_day", 36, 0, {}], ["emb_day", 37, 0, {}], ["emb_day", 38, 0, {}], ["emb_day", 39, 0, {}], ["emb_day", 40, 0, {}], ["emb_day", 41, 0, {}], ["emb_day", 42, 0, {}], ["emb_day", 43, 0, {}], ["emb_day", 44, 0, {}], ["emb_day", 45, 0, {}], ["emb_day", 46, 0, {}], ["emb_day", 47, 0, {}], ["emb_day", 48, 0, {}], ["emb_day", 49, 0, {}], ["emb_day", 50, 0, {}], ["emb_day", 51, 0, {}], ["emb_day", 52, 0, {}], ["emb_day", 53, 0, {}], ["emb_day", 54, 0, {}], ["emb_day", 55, 0, {}], ["emb_day", 56, 0, {}], ["emb_day", 57, 0, {}], ["emb_day", 58, 0, {}], ["emb_day", 59, 0, {}], ["emb_day", 60, 0, {}], ["emb_day", 61, 0, {}], ["emb_day", 62, 0, {}], ["emb_day", 63, 0, {}], ["emb_day", 64, 0, {}], ["emb_day", 65, 0, {}], ["emb_day", 66, 0, {}], ["emb_day", 67, 0, {}], ["emb_day", 68, 0, {}], ["emb_day", 69, 0, {}], ["emb_day", 70, 0, {}], ["emb_day", 71, 0, {}], ["emb_day", 72, 0, {}], ["emb_day", 73, 0, {}], ["emb_day", 74, 0, {}], ["emb_day", 75, 0, {}], ["emb_day", 76, 0, {}], ["emb_day", 77, 0, {}], ["emb_day", 78, 0, {}], ["emb_day", 79, 0, {}], ["emb_day", 80, 0, {}], ["emb_day", 81, 0, {}], ["emb_day", 82, 0, {}], ["emb_day", 83, 0, {}], ["emb_day", 84, 0, {}], ["emb_day", 85, 0, {}], ["emb_day", 86, 0, {}], ["emb_day", 87, 0, {}], ["emb_day", 88, 0, {}], ["emb_day", 89, 0, {}], ["emb_day", 90, 0, {}], ["emb_day", 91, 0, {}], ["emb_day", 92, 0, {}], ["emb_day", 93, 0, {}], ["emb_day", 94, 0, {}], ["emb_day", 95, 0, {}], ["emb_day", 96, 0, {}], ["emb_day", 97, 0, {}], ["emb_day", 98, 0, {}], ["emb_day", 99, 0, {}], ["emb_day", 100, 0, {}], ["emb_day", 101, 0, {}], ["emb_day", 102, 0, {}], ["emb_day", 103, 0, {}], ["emb_day", 104, 0, {}], ["emb_day", 105, 0, {}], ["emb_day", 106, 0, {}], ["emb_day", 107, 0, {}], ["emb_day", 108, 0, {}], ["emb_day", 109, 0, {}], ["emb_day", 110, 0, {}], ["emb_day", 111, 0, {}], ["emb_day", 112, 0, {}], ["emb_day", 113, 0, {}], ["emb_day", 114, 0, {}], ["emb_day", 115, 0, {}], ["emb_day", 116, 0, {}], ["emb_day", 117, 0, {}], ["emb_day", 118, 0, {}], ["emb_day", 119, 0, {}], ["emb_day", 120, 0, {}], ["emb_day", 121, 0, {}], ["emb_day", 122, 0, {}], ["emb_day", 123, 0, {}], ["emb_day", 124, 0, {}], ["emb_day", 125, 0, {}], ["emb_day", 126, 0, {}], ["emb_day", 127, 0, {}], ["emb_day", 128, 0, {}], ["emb_day", 129, 0, {}], ["emb_day", 130, 0, {}], ["emb_day", 131, 0, {}], ["emb_day", 132, 0, {}], ["emb_day", 133, 0, {}], ["emb_day", 134, 0, {}], ["emb_day", 135, 0, {}], ["emb_day", 136, 0, {}], ["emb_day", 137, 0, {}], ["emb_day", 138, 0, {}], ["emb_day", 139, 0, {}], ["emb_day", 140, 0, {}], ["emb_day", 141, 0, {}], ["emb_day", 142, 0, {}], ["emb_day", 143, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaBXN0YWNrKQHaAXipAHIGAAAA+jkvbWVkaWEvcmFpZC9qaW5tZW5nL3BldHJ5LTIwMjAt\nbWFyYy9MU1RNX1RyYWpHQU4vbW9kZWwucHnaCDxsYW1iZGE+ZQAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["emb_hour", 0, 0, {}], ["emb_hour", 1, 0, {}], ["emb_hour", 2, 0, {}], ["emb_hour", 3, 0, {}], ["emb_hour", 4, 0, {}], ["emb_hour", 5, 0, {}], ["emb_hour", 6, 0, {}], ["emb_hour", 7, 0, {}], ["emb_hour", 8, 0, {}], ["emb_hour", 9, 0, {}], ["emb_hour", 10, 0, {}], ["emb_hour", 11, 0, {}], ["emb_hour", 12, 0, {}], ["emb_hour", 13, 0, {}], ["emb_hour", 14, 0, {}], ["emb_hour", 15, 0, {}], ["emb_hour", 16, 0, {}], ["emb_hour", 17, 0, {}], ["emb_hour", 18, 0, {}], ["emb_hour", 19, 0, {}], ["emb_hour", 20, 0, {}], ["emb_hour", 21, 0, {}], ["emb_hour", 22, 0, {}], ["emb_hour", 23, 0, {}], ["emb_hour", 24, 0, {}], ["emb_hour", 25, 0, {}], ["emb_hour", 26, 0, {}], ["emb_hour", 27, 0, {}], ["emb_hour", 28, 0, {}], ["emb_hour", 29, 0, {}], ["emb_hour", 30, 0, {}], ["emb_hour", 31, 0, {}], ["emb_hour", 32, 0, {}], ["emb_hour", 33, 0, {}], ["emb_hour", 34, 0, {}], ["emb_hour", 35, 0, {}], ["emb_hour", 36, 0, {}], ["emb_hour", 37, 0, {}], ["emb_hour", 38, 0, {}], ["emb_hour", 39, 0, {}], ["emb_hour", 40, 0, {}], ["emb_hour", 41, 0, {}], ["emb_hour", 42, 0, {}], ["emb_hour", 43, 0, {}], ["emb_hour", 44, 0, {}], ["emb_hour", 45, 0, {}], ["emb_hour", 46, 0, {}], ["emb_hour", 47, 0, {}], ["emb_hour", 48, 0, {}], ["emb_hour", 49, 0, {}], ["emb_hour", 50, 0, {}], ["emb_hour", 51, 0, {}], ["emb_hour", 52, 0, {}], ["emb_hour", 53, 0, {}], ["emb_hour", 54, 0, {}], ["emb_hour", 55, 0, {}], ["emb_hour", 56, 0, {}], ["emb_hour", 57, 0, {}], ["emb_hour", 58, 0, {}], ["emb_hour", 59, 0, {}], ["emb_hour", 60, 0, {}], ["emb_hour", 61, 0, {}], ["emb_hour", 62, 0, {}], ["emb_hour", 63, 0, {}], ["emb_hour", 64, 0, {}], ["emb_hour", 65, 0, {}], ["emb_hour", 66, 0, {}], ["emb_hour", 67, 0, {}], ["emb_hour", 68, 0, {}], ["emb_hour", 69, 0, {}], ["emb_hour", 70, 0, {}], ["emb_hour", 71, 0, {}], ["emb_hour", 72, 0, {}], ["emb_hour", 73, 0, {}], ["emb_hour", 74, 0, {}], ["emb_hour", 75, 0, {}], ["emb_hour", 76, 0, {}], ["emb_hour", 77, 0, {}], ["emb_hour", 78, 0, {}], ["emb_hour", 79, 0, {}], ["emb_hour", 80, 0, {}], ["emb_hour", 81, 0, {}], ["emb_hour", 82, 0, {}], ["emb_hour", 83, 0, {}], ["emb_hour", 84, 0, {}], ["emb_hour", 85, 0, {}], ["emb_hour", 86, 0, {}], ["emb_hour", 87, 0, {}], ["emb_hour", 88, 0, {}], ["emb_hour", 89, 0, {}], ["emb_hour", 90, 0, {}], ["emb_hour", 91, 0, {}], ["emb_hour", 92, 0, {}], ["emb_hour", 93, 0, {}], ["emb_hour", 94, 0, {}], ["emb_hour", 95, 0, {}], ["emb_hour", 96, 0, {}], ["emb_hour", 97, 0, {}], ["emb_hour", 98, 0, {}], ["emb_hour", 99, 0, {}], ["emb_hour", 100, 0, {}], ["emb_hour", 101, 0, {}], ["emb_hour", 102, 0, {}], ["emb_hour", 103, 0, {}], ["emb_hour", 104, 0, {}], ["emb_hour", 105, 0, {}], ["emb_hour", 106, 0, {}], ["emb_hour", 107, 0, {}], ["emb_hour", 108, 0, {}], ["emb_hour", 109, 0, {}], ["emb_hour", 110, 0, {}], ["emb_hour", 111, 0, {}], ["emb_hour", 112, 0, {}], ["emb_hour", 113, 0, {}], ["emb_hour", 114, 0, {}], ["emb_hour", 115, 0, {}], ["emb_hour", 116, 0, {}], ["emb_hour", 117, 0, {}], ["emb_hour", 118, 0, {}], ["emb_hour", 119, 0, {}], ["emb_hour", 120, 0, {}], ["emb_hour", 121, 0, {}], ["emb_hour", 122, 0, {}], ["emb_hour", 123, 0, {}], ["emb_hour", 124, 0, {}], ["emb_hour", 125, 0, {}], ["emb_hour", 126, 0, {}], ["emb_hour", 127, 0, {}], ["emb_hour", 128, 0, {}], ["emb_hour", 129, 0, {}], ["emb_hour", 130, 0, {}], ["emb_hour", 131, 0, {}], ["emb_hour", 132, 0, {}], ["emb_hour", 133, 0, {}], ["emb_hour", 134, 0, {}], ["emb_hour", 135, 0, {}], ["emb_hour", 136, 0, {}], ["emb_hour", 137, 0, {}], ["emb_hour", 138, 0, {}], ["emb_hour", 139, 0, {}], ["emb_hour", 140, 0, {}], ["emb_hour", 141, 0, {}], ["emb_hour", 142, 0, {}], ["emb_hour", 143, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaBXN0YWNrKQHaAXipAHIGAAAA+jkvbWVkaWEvcmFpZC9qaW5tZW5nL3BldHJ5LTIwMjAt\nbWFyYy9MU1RNX1RyYWpHQU4vbW9kZWwucHnaCDxsYW1iZGE+ZQAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["emb_category", 0, 0, {}], ["emb_category", 1, 0, {}], ["emb_category", 2, 0, {}], ["emb_category", 3, 0, {}], ["emb_category", 4, 0, {}], ["emb_category", 5, 0, {}], ["emb_category", 6, 0, {}], ["emb_category", 7, 0, {}], ["emb_category", 8, 0, {}], ["emb_category", 9, 0, {}], ["emb_category", 10, 0, {}], ["emb_category", 11, 0, {}], ["emb_category", 12, 0, {}], ["emb_category", 13, 0, {}], ["emb_category", 14, 0, {}], ["emb_category", 15, 0, {}], ["emb_category", 16, 0, {}], ["emb_category", 17, 0, {}], ["emb_category", 18, 0, {}], ["emb_category", 19, 0, {}], ["emb_category", 20, 0, {}], ["emb_category", 21, 0, {}], ["emb_category", 22, 0, {}], ["emb_category", 23, 0, {}], ["emb_category", 24, 0, {}], ["emb_category", 25, 0, {}], ["emb_category", 26, 0, {}], ["emb_category", 27, 0, {}], ["emb_category", 28, 0, {}], ["emb_category", 29, 0, {}], ["emb_category", 30, 0, {}], ["emb_category", 31, 0, {}], ["emb_category", 32, 0, {}], ["emb_category", 33, 0, {}], ["emb_category", 34, 0, {}], ["emb_category", 35, 0, {}], ["emb_category", 36, 0, {}], ["emb_category", 37, 0, {}], ["emb_category", 38, 0, {}], ["emb_category", 39, 0, {}], ["emb_category", 40, 0, {}], ["emb_category", 41, 0, {}], ["emb_category", 42, 0, {}], ["emb_category", 43, 0, {}], ["emb_category", 44, 0, {}], ["emb_category", 45, 0, {}], ["emb_category", 46, 0, {}], ["emb_category", 47, 0, {}], ["emb_category", 48, 0, {}], ["emb_category", 49, 0, {}], ["emb_category", 50, 0, {}], ["emb_category", 51, 0, {}], ["emb_category", 52, 0, {}], ["emb_category", 53, 0, {}], ["emb_category", 54, 0, {}], ["emb_category", 55, 0, {}], ["emb_category", 56, 0, {}], ["emb_category", 57, 0, {}], ["emb_category", 58, 0, {}], ["emb_category", 59, 0, {}], ["emb_category", 60, 0, {}], ["emb_category", 61, 0, {}], ["emb_category", 62, 0, {}], ["emb_category", 63, 0, {}], ["emb_category", 64, 0, {}], ["emb_category", 65, 0, {}], ["emb_category", 66, 0, {}], ["emb_category", 67, 0, {}], ["emb_category", 68, 0, {}], ["emb_category", 69, 0, {}], ["emb_category", 70, 0, {}], ["emb_category", 71, 0, {}], ["emb_category", 72, 0, {}], ["emb_category", 73, 0, {}], ["emb_category", 74, 0, {}], ["emb_category", 75, 0, {}], ["emb_category", 76, 0, {}], ["emb_category", 77, 0, {}], ["emb_category", 78, 0, {}], ["emb_category", 79, 0, {}], ["emb_category", 80, 0, {}], ["emb_category", 81, 0, {}], ["emb_category", 82, 0, {}], ["emb_category", 83, 0, {}], ["emb_category", 84, 0, {}], ["emb_category", 85, 0, {}], ["emb_category", 86, 0, {}], ["emb_category", 87, 0, {}], ["emb_category", 88, 0, {}], ["emb_category", 89, 0, {}], ["emb_category", 90, 0, {}], ["emb_category", 91, 0, {}], ["emb_category", 92, 0, {}], ["emb_category", 93, 0, {}], ["emb_category", 94, 0, {}], ["emb_category", 95, 0, {}], ["emb_category", 96, 0, {}], ["emb_category", 97, 0, {}], ["emb_category", 98, 0, {}], ["emb_category", 99, 0, {}], ["emb_category", 100, 0, {}], ["emb_category", 101, 0, {}], ["emb_category", 102, 0, {}], ["emb_category", 103, 0, {}], ["emb_category", 104, 0, {}], ["emb_category", 105, 0, {}], ["emb_category", 106, 0, {}], ["emb_category", 107, 0, {}], ["emb_category", 108, 0, {}], ["emb_category", 109, 0, {}], ["emb_category", 110, 0, {}], ["emb_category", 111, 0, {}], ["emb_category", 112, 0, {}], ["emb_category", 113, 0, {}], ["emb_category", 114, 0, {}], ["emb_category", 115, 0, {}], ["emb_category", 116, 0, {}], ["emb_category", 117, 0, {}], ["emb_category", 118, 0, {}], ["emb_category", 119, 0, {}], ["emb_category", 120, 0, {}], ["emb_category", 121, 0, {}], ["emb_category", 122, 0, {}], ["emb_category", 123, 0, {}], ["emb_category", 124, 0, {}], ["emb_category", 125, 0, {}], ["emb_category", 126, 0, {}], ["emb_category", 127, 0, {}], ["emb_category", 128, 0, {}], ["emb_category", 129, 0, {}], ["emb_category", 130, 0, {}], ["emb_category", 131, 0, {}], ["emb_category", 132, 0, {}], ["emb_category", 133, 0, {}], ["emb_category", 134, 0, {}], ["emb_category", 135, 0, {}], ["emb_category", 136, 0, {}], ["emb_category", 137, 0, {}], ["emb_category", 138, 0, {}], ["emb_category", 139, 0, {}], ["emb_category", 140, 0, {}], ["emb_category", 141, 0, {}], ["emb_category", 142, 0, {}], ["emb_category", 143, 0, {}]]]}, {"name": "concatenate_146", "class_name": "Concatenate", "config": {"name": "concatenate_146", "trainable": true, "axis": 2}, "inbound_nodes": [[["lambda_14", 0, 0, {}], ["lambda_16", 0, 0, {}], ["lambda_18", 0, 0, {}], ["lambda_20", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaB3Vuc3RhY2spAdoBeKkAcgYAAAD6OS9tZWRpYS9yYWlkL2ppbm1lbmcvcGV0cnktMjAy\nMC1tYXJjL0xTVE1fVHJhakdBTi9tb2RlbC5wedoIPGxhbWJkYT5rAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["concatenate_146", 0, 0, {}]]]}, {"name": "emb_trajpoint", "class_name": "Dense", "config": {"name": "emb_trajpoint", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_21", 0, 0, {}]], [["lambda_21", 0, 1, {}]], [["lambda_21", 0, 2, {}]], [["lambda_21", 0, 3, {}]], [["lambda_21", 0, 4, {}]], [["lambda_21", 0, 5, {}]], [["lambda_21", 0, 6, {}]], [["lambda_21", 0, 7, {}]], [["lambda_21", 0, 8, {}]], [["lambda_21", 0, 9, {}]], [["lambda_21", 0, 10, {}]], [["lambda_21", 0, 11, {}]], [["lambda_21", 0, 12, {}]], [["lambda_21", 0, 13, {}]], [["lambda_21", 0, 14, {}]], [["lambda_21", 0, 15, {}]], [["lambda_21", 0, 16, {}]], [["lambda_21", 0, 17, {}]], [["lambda_21", 0, 18, {}]], [["lambda_21", 0, 19, {}]], [["lambda_21", 0, 20, {}]], [["lambda_21", 0, 21, {}]], [["lambda_21", 0, 22, {}]], [["lambda_21", 0, 23, {}]], [["lambda_21", 0, 24, {}]], [["lambda_21", 0, 25, {}]], [["lambda_21", 0, 26, {}]], [["lambda_21", 0, 27, {}]], [["lambda_21", 0, 28, {}]], [["lambda_21", 0, 29, {}]], [["lambda_21", 0, 30, {}]], [["lambda_21", 0, 31, {}]], [["lambda_21", 0, 32, {}]], [["lambda_21", 0, 33, {}]], [["lambda_21", 0, 34, {}]], [["lambda_21", 0, 35, {}]], [["lambda_21", 0, 36, {}]], [["lambda_21", 0, 37, {}]], [["lambda_21", 0, 38, {}]], [["lambda_21", 0, 39, {}]], [["lambda_21", 0, 40, {}]], [["lambda_21", 0, 41, {}]], [["lambda_21", 0, 42, {}]], [["lambda_21", 0, 43, {}]], [["lambda_21", 0, 44, {}]], [["lambda_21", 0, 45, {}]], [["lambda_21", 0, 46, {}]], [["lambda_21", 0, 47, {}]], [["lambda_21", 0, 48, {}]], [["lambda_21", 0, 49, {}]], [["lambda_21", 0, 50, {}]], [["lambda_21", 0, 51, {}]], [["lambda_21", 0, 52, {}]], [["lambda_21", 0, 53, {}]], [["lambda_21", 0, 54, {}]], [["lambda_21", 0, 55, {}]], [["lambda_21", 0, 56, {}]], [["lambda_21", 0, 57, {}]], [["lambda_21", 0, 58, {}]], [["lambda_21", 0, 59, {}]], [["lambda_21", 0, 60, {}]], [["lambda_21", 0, 61, {}]], [["lambda_21", 0, 62, {}]], [["lambda_21", 0, 63, {}]], [["lambda_21", 0, 64, {}]], [["lambda_21", 0, 65, {}]], [["lambda_21", 0, 66, {}]], [["lambda_21", 0, 67, {}]], [["lambda_21", 0, 68, {}]], [["lambda_21", 0, 69, {}]], [["lambda_21", 0, 70, {}]], [["lambda_21", 0, 71, {}]], [["lambda_21", 0, 72, {}]], [["lambda_21", 0, 73, {}]], [["lambda_21", 0, 74, {}]], [["lambda_21", 0, 75, {}]], [["lambda_21", 0, 76, {}]], [["lambda_21", 0, 77, {}]], [["lambda_21", 0, 78, {}]], [["lambda_21", 0, 79, {}]], [["lambda_21", 0, 80, {}]], [["lambda_21", 0, 81, {}]], [["lambda_21", 0, 82, {}]], [["lambda_21", 0, 83, {}]], [["lambda_21", 0, 84, {}]], [["lambda_21", 0, 85, {}]], [["lambda_21", 0, 86, {}]], [["lambda_21", 0, 87, {}]], [["lambda_21", 0, 88, {}]], [["lambda_21", 0, 89, {}]], [["lambda_21", 0, 90, {}]], [["lambda_21", 0, 91, {}]], [["lambda_21", 0, 92, {}]], [["lambda_21", 0, 93, {}]], [["lambda_21", 0, 94, {}]], [["lambda_21", 0, 95, {}]], [["lambda_21", 0, 96, {}]], [["lambda_21", 0, 97, {}]], [["lambda_21", 0, 98, {}]], [["lambda_21", 0, 99, {}]], [["lambda_21", 0, 100, {}]], [["lambda_21", 0, 101, {}]], [["lambda_21", 0, 102, {}]], [["lambda_21", 0, 103, {}]], [["lambda_21", 0, 104, {}]], [["lambda_21", 0, 105, {}]], [["lambda_21", 0, 106, {}]], [["lambda_21", 0, 107, {}]], [["lambda_21", 0, 108, {}]], [["lambda_21", 0, 109, {}]], [["lambda_21", 0, 110, {}]], [["lambda_21", 0, 111, {}]], [["lambda_21", 0, 112, {}]], [["lambda_21", 0, 113, {}]], [["lambda_21", 0, 114, {}]], [["lambda_21", 0, 115, {}]], [["lambda_21", 0, 116, {}]], [["lambda_21", 0, 117, {}]], [["lambda_21", 0, 118, {}]], [["lambda_21", 0, 119, {}]], [["lambda_21", 0, 120, {}]], [["lambda_21", 0, 121, {}]], [["lambda_21", 0, 122, {}]], [["lambda_21", 0, 123, {}]], [["lambda_21", 0, 124, {}]], [["lambda_21", 0, 125, {}]], [["lambda_21", 0, 126, {}]], [["lambda_21", 0, 127, {}]], [["lambda_21", 0, 128, {}]], [["lambda_21", 0, 129, {}]], [["lambda_21", 0, 130, {}]], [["lambda_21", 0, 131, {}]], [["lambda_21", 0, 132, {}]], [["lambda_21", 0, 133, {}]], [["lambda_21", 0, 134, {}]], [["lambda_21", 0, 135, {}]], [["lambda_21", 0, 136, {}]], [["lambda_21", 0, 137, {}]], [["lambda_21", 0, 138, {}]], [["lambda_21", 0, 139, {}]], [["lambda_21", 0, 140, {}]], [["lambda_21", 0, 141, {}]], [["lambda_21", 0, 142, {}]], [["lambda_21", 0, 143, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoCdGbaBXN0YWNrKQHaAXipAHIGAAAA+jkvbWVkaWEvcmFpZC9qaW5tZW5nL3BldHJ5LTIwMjAt\nbWFyYy9MU1RNX1RyYWpHQU4vbW9kZWwucHnaCDxsYW1iZGE+bgAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["emb_trajpoint", 0, 0, {}], ["emb_trajpoint", 1, 0, {}], ["emb_trajpoint", 2, 0, {}], ["emb_trajpoint", 3, 0, {}], ["emb_trajpoint", 4, 0, {}], ["emb_trajpoint", 5, 0, {}], ["emb_trajpoint", 6, 0, {}], ["emb_trajpoint", 7, 0, {}], ["emb_trajpoint", 8, 0, {}], ["emb_trajpoint", 9, 0, {}], ["emb_trajpoint", 10, 0, {}], ["emb_trajpoint", 11, 0, {}], ["emb_trajpoint", 12, 0, {}], ["emb_trajpoint", 13, 0, {}], ["emb_trajpoint", 14, 0, {}], ["emb_trajpoint", 15, 0, {}], ["emb_trajpoint", 16, 0, {}], ["emb_trajpoint", 17, 0, {}], ["emb_trajpoint", 18, 0, {}], ["emb_trajpoint", 19, 0, {}], ["emb_trajpoint", 20, 0, {}], ["emb_trajpoint", 21, 0, {}], ["emb_trajpoint", 22, 0, {}], ["emb_trajpoint", 23, 0, {}], ["emb_trajpoint", 24, 0, {}], ["emb_trajpoint", 25, 0, {}], ["emb_trajpoint", 26, 0, {}], ["emb_trajpoint", 27, 0, {}], ["emb_trajpoint", 28, 0, {}], ["emb_trajpoint", 29, 0, {}], ["emb_trajpoint", 30, 0, {}], ["emb_trajpoint", 31, 0, {}], ["emb_trajpoint", 32, 0, {}], ["emb_trajpoint", 33, 0, {}], ["emb_trajpoint", 34, 0, {}], ["emb_trajpoint", 35, 0, {}], ["emb_trajpoint", 36, 0, {}], ["emb_trajpoint", 37, 0, {}], ["emb_trajpoint", 38, 0, {}], ["emb_trajpoint", 39, 0, {}], ["emb_trajpoint", 40, 0, {}], ["emb_trajpoint", 41, 0, {}], ["emb_trajpoint", 42, 0, {}], ["emb_trajpoint", 43, 0, {}], ["emb_trajpoint", 44, 0, {}], ["emb_trajpoint", 45, 0, {}], ["emb_trajpoint", 46, 0, {}], ["emb_trajpoint", 47, 0, {}], ["emb_trajpoint", 48, 0, {}], ["emb_trajpoint", 49, 0, {}], ["emb_trajpoint", 50, 0, {}], ["emb_trajpoint", 51, 0, {}], ["emb_trajpoint", 52, 0, {}], ["emb_trajpoint", 53, 0, {}], ["emb_trajpoint", 54, 0, {}], ["emb_trajpoint", 55, 0, {}], ["emb_trajpoint", 56, 0, {}], ["emb_trajpoint", 57, 0, {}], ["emb_trajpoint", 58, 0, {}], ["emb_trajpoint", 59, 0, {}], ["emb_trajpoint", 60, 0, {}], ["emb_trajpoint", 61, 0, {}], ["emb_trajpoint", 62, 0, {}], ["emb_trajpoint", 63, 0, {}], ["emb_trajpoint", 64, 0, {}], ["emb_trajpoint", 65, 0, {}], ["emb_trajpoint", 66, 0, {}], ["emb_trajpoint", 67, 0, {}], ["emb_trajpoint", 68, 0, {}], ["emb_trajpoint", 69, 0, {}], ["emb_trajpoint", 70, 0, {}], ["emb_trajpoint", 71, 0, {}], ["emb_trajpoint", 72, 0, {}], ["emb_trajpoint", 73, 0, {}], ["emb_trajpoint", 74, 0, {}], ["emb_trajpoint", 75, 0, {}], ["emb_trajpoint", 76, 0, {}], ["emb_trajpoint", 77, 0, {}], ["emb_trajpoint", 78, 0, {}], ["emb_trajpoint", 79, 0, {}], ["emb_trajpoint", 80, 0, {}], ["emb_trajpoint", 81, 0, {}], ["emb_trajpoint", 82, 0, {}], ["emb_trajpoint", 83, 0, {}], ["emb_trajpoint", 84, 0, {}], ["emb_trajpoint", 85, 0, {}], ["emb_trajpoint", 86, 0, {}], ["emb_trajpoint", 87, 0, {}], ["emb_trajpoint", 88, 0, {}], ["emb_trajpoint", 89, 0, {}], ["emb_trajpoint", 90, 0, {}], ["emb_trajpoint", 91, 0, {}], ["emb_trajpoint", 92, 0, {}], ["emb_trajpoint", 93, 0, {}], ["emb_trajpoint", 94, 0, {}], ["emb_trajpoint", 95, 0, {}], ["emb_trajpoint", 96, 0, {}], ["emb_trajpoint", 97, 0, {}], ["emb_trajpoint", 98, 0, {}], ["emb_trajpoint", 99, 0, {}], ["emb_trajpoint", 100, 0, {}], ["emb_trajpoint", 101, 0, {}], ["emb_trajpoint", 102, 0, {}], ["emb_trajpoint", 103, 0, {}], ["emb_trajpoint", 104, 0, {}], ["emb_trajpoint", 105, 0, {}], ["emb_trajpoint", 106, 0, {}], ["emb_trajpoint", 107, 0, {}], ["emb_trajpoint", 108, 0, {}], ["emb_trajpoint", 109, 0, {}], ["emb_trajpoint", 110, 0, {}], ["emb_trajpoint", 111, 0, {}], ["emb_trajpoint", 112, 0, {}], ["emb_trajpoint", 113, 0, {}], ["emb_trajpoint", 114, 0, {}], ["emb_trajpoint", 115, 0, {}], ["emb_trajpoint", 116, 0, {}], ["emb_trajpoint", 117, 0, {}], ["emb_trajpoint", 118, 0, {}], ["emb_trajpoint", 119, 0, {}], ["emb_trajpoint", 120, 0, {}], ["emb_trajpoint", 121, 0, {}], ["emb_trajpoint", 122, 0, {}], ["emb_trajpoint", 123, 0, {}], ["emb_trajpoint", 124, 0, {}], ["emb_trajpoint", 125, 0, {}], ["emb_trajpoint", 126, 0, {}], ["emb_trajpoint", 127, 0, {}], ["emb_trajpoint", 128, 0, {}], ["emb_trajpoint", 129, 0, {}], ["emb_trajpoint", 130, 0, {}], ["emb_trajpoint", 131, 0, {}], ["emb_trajpoint", 132, 0, {}], ["emb_trajpoint", 133, 0, {}], ["emb_trajpoint", 134, 0, {}], ["emb_trajpoint", 135, 0, {}], ["emb_trajpoint", 136, 0, {}], ["emb_trajpoint", 137, 0, {}], ["emb_trajpoint", 138, 0, {}], ["emb_trajpoint", 139, 0, {}], ["emb_trajpoint", 140, 0, {}], ["emb_trajpoint", 141, 0, {}], ["emb_trajpoint", 142, 0, {}], ["emb_trajpoint", 143, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l1": 0.019999999552965164, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lambda_22", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": 