{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_day", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144], "dtype": "float32", "sparse": false, "name": "input_day"}, "inbound_nodes": []}, {"name": "input_hour", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144], "dtype": "float32", "sparse": false, "name": "input_hour"}, "inbound_nodes": []}, {"name": "input_category", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144], "dtype": "float32", "sparse": false, "name": "input_category"}, "inbound_nodes": []}, {"name": "input_lat_lon", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 40], "dtype": "float32", "sparse": false, "name": "input_lat_lon"}, "inbound_nodes": []}, {"name": "emb_day", "class_name": "Embedding", "config": {"name": "emb_day", "trainable": true, "batch_input_shape": [null, 144], "dtype": "float32", "input_dim": 7, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 144}, "inbound_nodes": [[["input_day", 0, 0, {}]]]}, {"name": "emb_hour", "class_name": "Embedding", "config": {"name": "emb_hour", "trainable": true, "batch_input_shape": [null, 144], "dtype": "float32", "input_dim": 24, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 144}, "inbound_nodes": [[["input_hour", 0, 0, {}]]]}, {"name": "emb_category", "class_name": "Embedding", "config": {"name": "emb_category", "trainable": true, "batch_input_shape": [null, 144], "dtype": "float32", "input_dim": 10, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 144}, "inbound_nodes": [[["input_category", 0, 0, {}]]]}, {"name": "emb_lat_lon", "class_name": "Dense", "config": {"name": "emb_lat_lon", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_lat_lon", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 2}, "inbound_nodes": [[["emb_day", 0, 0, {}], ["emb_hour", 0, 0, {}], ["emb_category", 0, 0, {}], ["emb_lat_lon", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l1": 0.019999999552965164, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 193, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["input_day", 0, 0], ["input_hour", 0, 0], ["input_category", 0, 0], ["input_lat_lon", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}